app/controllers/api/shares_controller.rb

  def show
    @share = Share.find(params[:id])
---
SELECT "shares".* FROM "shares" WHERE "shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def random
    shares = Share.all
---
SELECT "shares".* FROM "shares"

  def create
    @share = Share.new(share_params)
    @share.save
---
INSERT INTO "shares" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "i hope your boy comes back"], ["user_id", 1], ["created_at", "2022-08-29 21:35:40.879586"], ["updated_at", "2022-08-29 21:35:40.879586"]]